# ================================================================
# 3.2 - задание
# ================================================================
# Студент правильно решили задачу ✅


'''
Но можно было сделать покороче конечно, для этого надо было создать список с количествами дней как тут: 👇
['31 день', '28 день', '31 день', ...]
И доставить нужный результат по индексу только отняв 1 так как индекс и списка начинается с нуля
Например если пользователь ввел 1 но первый индекс это дни за февраль поэтому нужно months[month_num-1] то есть 0 индекс. И так каждый раз. Но тогда вы столкнетесь со след проблемой это обработка ошибки если индекс неверен то есть если пользователь ввел негативное число или слишком большое число, тогда вам придется использовать try, except которых вы еще не прошли так что ваше первое решение вполне логично и правильно )
'''

# ================================================================
